In [29]:
import numpy as np
import pandas as pd

### Groupby

In [30]:
df=pd.read_csv(r"C:\Users\admin\Desktop\sample2.csv")
df.head(3)

   Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
0         1       A     CS     56.0       57.0   58.0      59.0  01-01-2001
1         2       A    ECE     23.0       24.0   25.0      26.0  02-01-2001
2         3       B   MECH     89.0       25.0   26.0      27.0  03-01-2001

In [31]:
branch_group=df.groupby(by='Branch')
branch_group

In [32]:
df['Branch'].unique()

array(['CS', 'ECE', 'MECH', nan], dtype=object)

In [33]:
branch_group.groups

{'CS': [0, 4, 6, 9, 11, 12, 13, 26, 27, 28, 29], 'ECE': [1, 5, 8, 10, 14, 18, 22, 25], 'MECH': [2, 3, 16, 17, 19, 20, 21, 23, 24]}

In [38]:
store=df.groupby(by=['Branch','Section'])
print(store.groups)

{('CS', 'A'): [0, 4, 9, 12, 13, 28, 29], ('CS', 'B'): [6, 26], ('CS', 'C'): [11, 27], ('ECE', 'A'): [1, 5, 8, 25], ('ECE', 'B'): [10, 14, 18, 22], ('MECH', 'A'): [16, 17, 20, 21, 24], ('MECH', 'B'): [2], ('MECH', 'C'): [3, 19, 23], (nan, 'C'): [7, 15]}

In [37]:
for i,j in store:
    print(i)
    print(j)

('CS', 'A')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
0          1       A     CS     56.0       57.0   58.0      59.0  01-01-2001
4          5       A     CS     23.0       27.0   28.0      29.0  05-01-2001
9         10       A     CS     45.0       16.0   17.0      18.0  10-01-2001
12        13       A     CS     22.0       23.0   24.0      25.0  13-01-2001
13        14       A     CS     90.0        NaN    NaN      42.0  14-01-2001
28        29       A     CS     57.0       36.0   36.0      66.0  29-01-2001
29        30       A     CS     58.0       37.0   37.0      43.0  30-01-2001
('CS', 'B')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
6          7       B     CS     12.0       13.0   14.0      15.0  07-01-2001
26        27       B     CS     55.0       34.0   34.0      55.0  27-01-2001
('CS', 'C')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
11        12       C     CS     88.0        NaN   19.0      20.0  12-01-2001
27        28       C     CS     56.0       35.0   35.0       NaN  28-01-2001
('ECE', 'A')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
1          2       A    ECE     23.0       24.0   25.0      26.0  02-01-2001
5          6       A    ECE     90.0        NaN   29.0      30.0  06-01-2001
8          9       A    ECE      NaN       15.0   16.0      17.0  09-01-2001
25        26       A    ECE     54.0       33.0   33.0      54.0  26-01-2001
('ECE', 'B')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
10        11       B    ECE      NaN       17.0   18.0      19.0  11-01-2001
14        15       B    ECE      NaN       43.0   43.0      43.0  15-01-2001
18        19       B    ECE     47.0       47.0   47.0      47.0  19-01-2001
22        23       B    ECE     51.0       51.0   51.0      51.0  23-01-2001
('MECH', 'A')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
16        17       A   MECH     45.0       45.0   45.0      45.0  17-01-2001
17        18       A   MECH     46.0       46.0   46.0      46.0  18-01-2001
20        21       A   MECH     49.0       49.0   49.0      49.0  21-01-2001
21        22       A   MECH     50.0       50.0   50.0      50.0  22-01-2001
24        25       A   MECH     53.0        NaN    NaN      53.0  25-01-2001
('MECH', 'B')
   Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
2         3       B   MECH     89.0       25.0   26.0      27.0  03-01-2001
('MECH', 'C')
    Roll No. Section Branch  Physics  Chemistry  Maths  Computer         DOB
3          4       C   MECH     45.0       26.0   27.0      28.0  04-01-2001
19        20       C   MECH     48.0       48.0   48.0      48.0  20-01-2001
23        24       C   MECH     52.0       52.0   52.0      52.0  24-01-2001

### Merge the Data Frame

In [39]:
df1=pd.DataFrame({"Roll":[1,2,3,4],'Physics':[23,45,67,8]})
df1

   Roll  Physics
0     1       23
1     2       45
2     3       67
3     4        8

In [40]:
df2=pd.DataFrame({"Roll":[1,2,3,4],'Chem':[27,15,61,8]})
df2

   Roll  Chem
0     1    27
1     2    15
2     3    61
3     4     8

In [41]:
pd.merge(df1,df2,on="Roll")

   Roll  Physics  Chem
0     1       23    27
1     2       45    15
2     3       67    61
3     4        8     8

In [42]:
pd.merge(df1,df2) #By default will select common intersecting columns

   Roll  Physics  Chem
0     1       23    27
1     2       45    15
2     3       67    61
3     4        8     8

#### What if Roll No. would be different?

In [43]:
df3=pd.DataFrame({"Roll":[1,2,3,8],'Maths':[17,50,61,99]})
df3

   Roll  Maths
0     1     17
1     2     50
2     3     61
3     8     99

In [45]:
pd.merge(df2,df3,how="left") #will take all roll no for df2(left)

   Roll  Chem  Maths
0     1    27   17.0
1     2    15   50.0
2     3    61   61.0
3     4     8    NaN

In [46]:
pd.merge(df2,df3,how="right")

   Roll  Chem  Maths
0     1  27.0     17
1     2  15.0     50
2     3  61.0     61
3     8   NaN     99

In [47]:
pd.merge(df2,df3,how="outer") #All Roll No. left and right.

   Roll  Chem  Maths
0     1  27.0   17.0
1     2  15.0   50.0
2     3  61.0   61.0
3     4   8.0    NaN
4     8   NaN   99.0